IDENTIFICATION DIVISION.                
PROGRAM-ID. PRG1.                       
ENVIRONMENT DIVISION.                   
DATA DIVISION.                          
PROCEDURE DIVISION.                     
    DISPLAY "HELLO WORLD!".          
    STOP RUN.     